In [1]:
import pandas as pd
import numpy as np

In [2]:
# pandas is the cross between the items and ditionary 
pd.Series?

In [3]:
animals=["tigers","bear","mouse"]
pd.Series(animals)

0    tigers
1      bear
2     mouse
dtype: object

In [4]:
numbers=[1,2,3,4,45,5,6,6,6,6,6,6,6,6,6,6,6,6,6,6,]
pd.Series(numbers)

0      1
1      2
2      3
3      4
4     45
5      5
6      6
7      6
8      6
9      6
10     6
11     6
12     6
13     6
14     6
15     6
16     6
17     6
18     6
19     6
dtype: int64

In [5]:
import numpy as np
np.nan == None

False

In [6]:
np.nan == np.nan

False

In [7]:
# nan means not a number  
np.isnan(np.nan)

True

In [8]:
# nan and none are same but numeric value traeted diffrently for efficient reasons

In [9]:
# we are creating a dictionaru 
Sports={
    "archery":"gokul js",
    "Age":24,
    "college":"cmrit"
}
# when we convert dictonaries to pandas data frame keys are used as special index 
s = pd.Series(Sports)

In [10]:
s

archery    gokul js
Age              24
college       cmrit
dtype: object

In [11]:
# now we only need index from the pandas series 
s.index

Index(['archery', 'Age', 'college'], dtype='object')

In [12]:
# querying the series 
# loc and iloc attribute

In [13]:
# we are creating a dictionaru 
Sports={
    "archery":"gokul js",
    "Age":24,
    "college":"cmrit"
}
# when we convert dictonaries to pandas data frame keys are used as special index 
s = pd.Series(Sports)

In [14]:
s

archery    gokul js
Age              24
college       cmrit
dtype: object

In [15]:
# iloc attribute is used to access the spicfic index by numeric value 
s.iloc[2]

'cmrit'

In [16]:
# loc attribute us going to acces index by using special index value
s.loc["Age"]

24

In [17]:
s[2]

'cmrit'

In [18]:
s['Age']

24

In [19]:
list=[i for i in range(0,100)]

In [20]:
list

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99]

In [21]:
s=pd.Series(list)
s

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [22]:
%%timeit -n 100
k=np.sum(s)
k

70.9 µs ± 1.89 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
%%timeit -n 100

total=0
for i in range(len(list)):
    total=total+list[i]
total

9.87 µs ± 1.06 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [24]:
s +=2
s.head()

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [25]:
%%timeit -n 5
s=pd.Series(np.random.randint(0,1000,10000))
for label,value in s.iteritems():
    s.loc[label]+=2
s

782 ms ± 21.3 ms per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [26]:
%%timeit -n 5
s=pd.Series(np.random.randint(0,1000,10000))
s+=2
s

332 µs ± 45.4 µs per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [27]:
#  getting started with dataframe 
# data anlaysis and

In [28]:
purchase1=pd.Series({
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
purchase2=pd.Series(
{
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
purchase3=pd.Series(
        {
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
df=pd.DataFrame([purchase1,purchase2,purchase3 ],index=['store1','store2','store3'])
df.head()

         name  cost purchase
store1  gokul  2000      yes
store2  gokul  2000      yes
store3  gokul  2000      yes

In [29]:
df.loc['store2']

name        gokul
cost         2000
purchase      yes
Name: store2, dtype: object

In [30]:
type(df.loc['store2'])

pandas.core.series.Series

In [31]:
s=df['cost']
k=np.sum(s)
k

6000

In [32]:
# in pandas columns alway have a selection 
df.loc['store1']['cost']

2000

In [33]:
df.loc[['store1','store2'],['name','cost']]

         name  cost
store1  gokul  2000
store2  gokul  2000

In [34]:
# dropping data in data frame 
df.drop('store1')

         name  cost purchase
store2  gokul  2000      yes
store3  gokul  2000      yes

In [35]:
df['location']=None

In [36]:
df.head()

         name  cost purchase location
store1  gokul  2000      yes     None
store2  gokul  2000      yes     None
store3  gokul  2000      yes     None

In [37]:
df['cost']=df['cost']*0.2

df.head()

         name   cost purchase location
store1  gokul  400.0      yes     None
store2  gokul  400.0      yes     None
store3  gokul  400.0      yes     None